print("Пінда Марія Володимирівна \nГрупа КМ-92 \nЛабораторна робота №1 \nОбчислення в математичних задачах \nВаріант 12 \nЗмінення значень змінних\n")
while True:
    try:
        a = float(input("Введіть число a: "))
        b = float(input("Введіть число b: "))
        c = float(input("Введіть число с: "))
        q = a                                                                          #Вводимо допоміжні змінні
        w = b
        e = c
        print("a =" ,round(a+b, 3))                                                    #Округлюємо результат до тисячних
        a = q
        print("b =" ,round(c-a, 3))
        b = w
        print("c =" ,round(a+b+c, 3))
        c = e
    except:
        print("Це не число.")
