print("Пінда Марія Володимирівна \nГрупа КМ-92 \nЛабораторна робота №1 \nВикористання математичних формул за виконанням певних умов\n")
print("Варіант 12 \nПеревірка, чи не приводить сумування двох цілих чисел А і В до переповнення\n")
while True:
    try:
        A = int(input("Введіть ціле число А: "))
        B = int(input("Введіть ціле число B: "))
        if (A+B)<=32767:
            print("A + B =", A+B)
        else:
            print("Переповнення! Результат не може бути більшим ніж 32 767")
    except:
        print("Помилка")

